In [1]:
## import libraries

import pandas as pd
import glob
# from tqdm import tqdm_notebook

from pathlib import Path
import sys

In [2]:
%load_ext sql

In [3]:
%load_ext lab_black

In [4]:
## import custom functions

# Create path to custom functions
funcs_path = Path.cwd().parents[1]
sys.path.insert(1, str(funcs_path))

from funcs import paths

In [5]:
## Get path to processed data folder

path_to_processed_data_folder = paths.get_path_to_folder("processed")

path_to_processed_data_folder

'C:\\Users\\RowanM\\Documents\\dublin_energy_masterplan\\Residential\\data\\inputs\\processed'

In [6]:
path_to_data_database = path_to_processed_data_folder + r"\data.db"

path_to_data_database

'C:\\Users\\RowanM\\Documents\\dublin_energy_masterplan\\Residential\\data\\inputs\\processed\\data.db'

In [7]:
%sql sqlite:///$path_to_data_database

'Connected: @C:\\Users\\RowanM\\Documents\\dublin_energy_masterplan\\Residential\\data\\inputs\\processed\\data.db'

In [8]:
%%sql 
SELECT * FROM electricity_data_raw
LIMIT 5

 * sqlite:///C:\Users\RowanM\Documents\dublin_energy_masterplan\Residential\data\inputs\processed\data.db
Done.

[('1392', 19503, 0.14, None, None),
 ('1392', 19504, 0.138, None, None),
 ('1392', 19505, 0.14, None, None),
 ('1392', 19506, 0.145, None, None),
 ('1392', 19507, 0.145, None, None)]

In [9]:
%%sql 
SELECT SUBSTR(Date_ID, 0, 4) AS Day, SUBSTR(Date_ID, 4, 2) AS Time_ID FROM electricity_data_raw
LIMIT 3;

 * sqlite:///C:\Users\RowanM\Documents\dublin_energy_masterplan\Residential\data\inputs\processed\data.db
Done.

[('195', '03'), ('195', '04'), ('195', '05')]

In [10]:
%%sql
ALTER TABLE electricity_data_raw
  ADD column Day INTEGER;

ALTER TABLE electricity_data_raw
  ADD column Time_ID INTEGER;

 * sqlite:///C:\Users\RowanM\Documents\dublin_energy_masterplan\Residential\data\inputs\processed\data.db
(sqlite3.OperationalError) duplicate column name: Day
[SQL: ALTER TABLE raw_electricity_data
  ADD column Day INTEGER;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [11]:
%%sql 
SELECT * FROM electricity_data_raw
LIMIT 3
;

 * sqlite:///C:\Users\RowanM\Documents\dublin_energy_masterplan\Residential\data\inputs\processed\data.db
Done.

[('1392', 19503, 0.14, None, None),
 ('1392', 19504, 0.138, None, None),
 ('1392', 19505, 0.14, None, None)]

In [12]:
%%time
%%sql 

UPDATE electricity_data_raw
  SET Day = SUBSTR(Date_ID, 0, 4);

UPDATE electricity_data_raw
  SET Time_ID = SUBSTR(Date_ID, 4, 2);

 * sqlite:///C:\Users\RowanM\Documents\dublin_energy_masterplan\Residential\data\inputs\processed\data.db
157992996 rows affected.
157992996 rows affected.
Wall time: 13min 16s

[]

In [14]:
%%sql 
SELECT * FROM electricity_data_raw
LIMIT 3
;

 * sqlite:///C:\Users\RowanM\Documents\dublin_energy_masterplan\Residential\data\inputs\processed\data.db
Done.

[('1392', 19503, 0.14, 195, 3),
 ('1392', 19504, 0.138, 195, 4),
 ('1392', 19505, 0.14, 195, 5)]